In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt
import matplotlib.pyplot as plt
import seaborn as sns


data_player = pd.read_csv('./datos/player_valuations.csv')
data_player

,player_id,date,market_value_in_eur,current_club_id,player_club_domestic_competition_id
0,405973,2000-01-20,150000,3057,BE1
1,342216,2001-07-20,100000,1241,SC1
2,3132,2003-12-09,400000,126,TR1
3,6893,2003-12-15,900000,984,GB1
4,10,2004-10-04,7000000,398,IT1
...,...,...,...,...,...
464777,1073997,2024-01-08,150000,18,L1
464778,361508,2024-01-10,300000,39,L1
464779,705337,2024-01-10,125000,26459,UKR1
464780,800946,2024-01-10,1000000,79,L1
464781,659225,2024-01-17,100000,5724,DK1

In [ ]:
#Cambiar Nombres de Columnas
data_player.rename(columns={"market_value_in_eur": 'precio_en_euros'}, inplace=True)
data_player.rename(columns={"player_id": 'id_jugador'}, inplace=True)
data_player.rename(columns={"date": 'fecha'}, inplace=True)
data_player.rename(columns={"current_club_id": 'id_actual_club'}, inplace=True)
data_player.rename(columns={"player_club_domestic_competition_id": 'id_jugador_competicion'}, inplace=True)

,jugador_id,fecha,precio_en_euros,id_actual_club,id_jugador_competicion
0,405973,2000-01-20,150000,3057,BE1
1,342216,2001-07-20,100000,1241,SC1
2,3132,2003-12-09,400000,126,TR1
3,6893,2003-12-15,900000,984,GB1
4,10,2004-10-04,7000000,398,IT1
...,...,...,...,...,...
464777,1073997,2024-01-08,150000,18,L1
464778,361508,2024-01-10,300000,39,L1
464779,705337,2024-01-10,125000,26459,UKR1
464780,800946,2024-01-10,1000000,79,L1
464781,659225,2024-01-17,100000,5724,DK1

In [ ]:
#Ordenar De Forma Descendente

data_player_sort = data_player.sort_values(by='precio_en_euros', ascending=False)
data_player_sort

,jugador_id,fecha,precio_en_euros,id_actual_club,id_jugador_competicion
292158,342229,2019-12-19,200000000,583,FR1
268400,342229,2019-06-03,200000000,583,FR1
252371,342229,2018-12-17,200000000,583,FR1
234794,28003,2018-05-30,180000000,583,FR1
252068,68290,2018-12-17,180000000,583,FR1
...,...,...,...,...,...
452456,58567,2023-08-25,10000,1506,TR1
452457,402536,2023-08-25,10000,114,TR1
452458,485578,2023-08-25,10000,126,TR1
452810,388361,2023-09-15,10000,126,TR1
15338,60096,2008-03-17,0,2696,RU1

In [ ]:
#Ordenar De Forma Ascendente
data_player_ordered = data_player.sort_values(by='precio_en_euros', ascending=True)
data_player_ordered

         jugador_id  precio_en_euros  id_actual_club
count  4.647820e+05     4.647820e+05   464782.000000
mean   2.044846e+05     2.359658e+06     4060.930382
std    1.861285e+05     6.666214e+06     9516.103619
min    1.000000e+01     0.000000e+00        3.000000
25%    5.684100e+04     2.000000e+05      369.000000
50%    1.495260e+05     5.000000e+05     1010.000000
75%    2.977720e+05     1.500000e+06     2969.000000
max    1.186012e+06     2.000000e+08    83678.000000

In [17]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)
data_player_ordered.describe()

       jugador_id  precio_en_euros  id_actual_club
count  464782.000       464782.000      464782.000
mean   204484.605      2359657.620        4060.930
std    186128.543      6666213.585        9516.104
min        10.000            0.000           3.000
25%     56841.000       200000.000         369.000
50%    149526.000       500000.000        1010.000
75%    297772.000      1500000.000        2969.000
max   1186012.000    200000000.000       83678.000

In [18]:
data_player_ordered['precio_en_euros'].mean()

np.float64(2359657.620129437)

In [19]:
data_player_ordered['precio_en_euros'].median()

np.float64(500000.0)

In [21]:
data_player_ordered['precio_en_euros'].mode()

0    300000
Name: precio_en_euros, dtype: int64